michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
/******************************************************************************
*  Filename:       sblAppEx.cpp
*  Revised:        $Date: 2014-10-09 14:34:40 +0200 (to, 09 okt 2014) $
*  Revision:       $Revision: 32696 $
*
*  Description:    Serial Bootloader Library application example.
*                  This example enumerates all COM devices and lets you
*                  select which port to connect to. The example assumes the
*                  connected device is a CC2538 or a CC2650 and programs a blinky
*                  onto the device. After programming the blinky, bootloader
*                  mode may be forced by holding the SELECT button on 06EB
*                  when resetting the chip.
*
*  Copyright (C) 2013 Texas Instruments Incorporated - http://www.ti.com/
*
*
*  Redistribution and use in source and binary forms, with or without
*  modification, are permitted provided that the following conditions
*  are met:
*
*    Redistributions of source code must retain the above copyright
*    notice, this list of conditions and the following disclaimer.
*
*    Redistributions in binary form must reproduce the above copyright
*    notice, this list of conditions and the following disclaimer in the
*    documentation and/or other materials provided with the distribution.
*
*    Neither the name of Texas Instruments Incorporated nor the names of
*    its contributors may be used to endorse or promote products derived
*    from this software without specific prior written permission.
*
*  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS
*  "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT
*  LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
*  A PARTICULAR PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT
*  OWNER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
*  SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT
*  LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE,
*  DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
*  THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
*  (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
*  OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*
******************************************************************************/
#ifndef _GNU_SOURCE
	#define _GNU_SOURCE
#endif
#include <stdlib.h>
#include <stdint.h>
#include <sbllib.h>
#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <syslog.h>


#include <string.h>
#include <stdio.h>
#include <unistd.h>
#include <syslog.h>
#include <stdlib.h>
#include <time.h>
#include <sys/timeb.h>  /* ftime, timeb (for timestamp in millisecond) */
#include <sys/time.h>   /* gettimeofday, timeval (for timestamp in microsecond) */
#include "CC2650_fw_update.h"

#ifdef ANDROID
	#define def_selected_serial_port "/dev/ttymxc2"
#else
	#ifdef OLINUXINO
			#define def_selected_serial_port "/dev/ttyS1"
	#else
			#define def_selected_serial_port "/dev/ttyUSB1"
	#endif
#endif

// Calculate crc32 checksum the way CC2538 and CC2650 does it.
static uint32_t calcCrcLikeChip(const unsigned char *pData, unsigned long ulByteCount)
{
    uint32_t d, ind;
    uint32_t acc = 0xFFFFFFFF;
    const uint32_t ulCrcRand32Lut[] =
    {
        0x00000000, 0x1DB71064, 0x3B6E20C8, 0x26D930AC,
        0x76DC4190, 0x6B6B51F4, 0x4DB26158, 0x5005713C,
        0xEDB88320, 0xF00F9344, 0xD6D6A3E8, 0xCB61B38C,
        0x9B64C2B0, 0x86D3D2D4, 0xA00AE278, 0xBDBDF21C
    };

    while ( ulByteCount-- )
    {
        d = *pData++;
        ind = (acc & 0x0F) ^ (d & 0x0F);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
        ind = (acc & 0x0F) ^ (d >> 4);
        acc = (acc >> 4) ^ ulCrcRand32Lut[ind];
    }

    return (acc ^ 0xFFFFFFFF);
}

#ifndef LOCALMAIN

#ifndef OLINUXINO_LIB
static void open_syslog(void)
{
	openlog("CC2650_fw_upd", LOG_PID|LOG_CONS, LOG_DAEMON);
	syslog(LOG_INFO, "Log just started");
}
#endif

#ifdef OLINUXINO_LIB
extern "C" int
#else
extern int
#endif
is_OK_do_CC2650_reset(unsigned int enable_boot_mode);

#if 0
static int64_t get_current_epoch_time_ms(void)
{
	struct timeb timer_msec;
	int64_t timestamp_msec; // timestamp in milliseconds
	if (!ftime(&timer_msec))
	{
		timestamp_msec = ((long long int) timer_msec.time) * 1000ll +	(long long int) timer_msec.millitm;
	}
	else
	{
		timestamp_msec = -1;
	}
	return timestamp_msec;
}
#endif


//
// Including functions for millisecond precision timing.
// Taken from http://stackoverflow.com/questions/2494356/how-to-use-gettimeofday-or-something-equivalent-with-visual-studio-c-2008
//
#include <time.h>



/// Application status function (used as SBL status callback)
static void appStatus(char *pcText, bool bError)
{
    if(bError)
    {
    	syslog(LOG_ERR, "%s", pcText);
    }
    else
    {
    	syslog(LOG_INFO, "%s", pcText);
    }
}

#ifdef OLINUXINO_LIB
static uint32_t percentage_progress = 0;
#endif

/// Application progress function (used as SBL progress callback)
static void appProgress(uint32_t progress)
{
#ifdef OLINUXINO_LIB
	percentage_progress = progress;
#endif
}

#ifdef OLINUXINO_LIB
extern "C"
#endif
uint32_t get_CC2650_fw_update_progress(void)
{
#ifdef OLINUXINO_LIB
	return percentage_progress;
#else
	return 0;
#endif

}

// Defines
#define DEVICE_CC2538				0x2538
#define DEVICE_CC26XX				0x2650
#define CC2538_FLASH_BASE			0x00200000
#define CC26XX_FLASH_BASE			0x00000000
#ifndef OLINUXINO_LIB
static void my_at_exit(void)
{
	// at exit, close the system log
	closelog();
}
#endif


const char *tbl_msg_CC2650_fw_update_retcode[]=
{
	"OK",							// firmware updated OK
	"ERR_unable_to_reset_chip",				// unable to reset the CC2650 chip
	"ERR_unable_to_create_SBL_object", 		// unable to create serial boot-loader library object
	"ERR_unable_to_connect_with_the_chip",	// unable to connect with the chip
	"ERR_unable_to_open_the_firmware_file", 	//
	"ERR_unable_to_erase_the_flash",			// unable to erase the chips internal flash
	"ERR_writing_flash",						//
	"ERR_CRC_calculating_gone_bad",			//
	"ERR_CRC_checking_gone_bad",				//
	"ERR_chip_reset_gone_bad",				//
	"ERR_unable_to_seek_to_the_file_end",	//
	"ERR_unable_to_get_filesize",			//
	"ERR_unable_to_seek_where_the_file_begins", //
	"ERR_unable_to_allocate_the_read_buffer",
	"ERR_unable_to_read_the_whole_file",
	"ERR_unable_to_close_the_file",
	"ERR_filesize_too_small",
	"ERR_invalid_header_CRC32",
	"ERR_invalid_header_magic_key",
	"ERR_invalid_body_size",
	"ERR_invalid_body_CRC",
	"ERR_unable_to_reset_the_chip_in_normal_mode",
	"ERR_invalid_operation_requested",
};

#ifdef OLINUXINO_LIB
extern "C"
#endif
const char * get_msg_from_CC2650_fw_update_retcode(enum_do_CC2650_fw_update_retcode r)
{
	if (r >= sizeof(tbl_msg_CC2650_fw_update_retcode) / sizeof(tbl_msg_CC2650_fw_update_retcode[0]))
	{
		return "UNKNOWN";
	}
	return tbl_msg_CC2650_fw_update_retcode[r];
}

#ifdef OLINUXINO_LIB
extern "C"
#endif
enum_do_CC2650_fw_update_retcode do_CC2650_fw_operation(enum_CC2650_fw_operation op, const char *path_binary_file, type_ASACZ_CC2650_fw_update_header *p_dst_header)
{
	enum_do_CC2650_fw_update_retcode r = enum_do_CC2650_fw_update_retcode_OK;
#ifndef OLINUXINO_LIB
	open_syslog();
	atexit(my_at_exit);
#endif
	syslog(LOG_INFO, "%s + starts", __func__);

#ifdef OLINUXINO_LIB
	percentage_progress = 0;
#endif

	uint32_t do_fw_update = 0;

	switch(op)
	{
		case enum_CC2650_fw_operation_update_firmware:
		{
			syslog(LOG_INFO, "%s firmware update requested", __func__);
			do_fw_update = 1;
			break;
		}
		case enum_CC2650_fw_operation_get_file_header_info:
		{
			syslog(LOG_INFO, "%s firmware file get header info requested", __func__);
			break;
		}
		default:
		{
			syslog(LOG_ERR, "%s invalid operation requested %u", __func__, op);
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_operation_requested;
			break;
		}
	}

	//
	// START: Program Configuration
	//
	/* Device type. (Binary-coded decimal of the device
	     e.g. 0x2538 for CC2538 and 0x2650 for CC2650) */
	uint32_t deviceType = 0x2650;

	//
	// END: Program configuration
	//

