michelesponchiado/CC2650_fw_update/src/sblAppEx.cpp
	SblDevice *pDevice = NULL;		// Pointer to SblDevice object
	const char * fileName;			// File name to program
	uint32_t byteCount = 0;			// File size in bytes
    uint32_t fileCrc, devCrc;		// Variables to save CRC checksum
	uint32_t devFlashBase;	    	// Flash start address
	char * pvWrite = (char *)malloc(1);// Vector to application firmware in.
	FILE * file;		// File stream


	fileName = path_binary_file;

	if (do_fw_update)
	{
		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			if (!is_OK_do_CC2650_reset(1))
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_reset_chip;
				syslog(LOG_ERR, "ERR_unable_to_reset_chip");
			}
		}

		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{

			devFlashBase = CC26XX_FLASH_BASE;

			//
			// Set callback functions
			//
			SblDevice::setCallBackStatusFunction(&appStatus);
			SblDevice::setCallBackProgressFunction(&appProgress);

			//
			// Create SBL object
			//
			pDevice = SblDevice::Create(deviceType);
			if(pDevice == NULL)
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_create_SBL_object;
				syslog(LOG_ERR, "ERR_unable_to_create_SBL_object");
			}
		}
		if (r == enum_do_CC2650_fw_update_retcode_OK)
		{
			unsigned int connected_OK = 0;
#define def_max_try_connect_CC2650 40
			int idx_try;
			for (idx_try = 0; !connected_OK && idx_try < def_max_try_connect_CC2650; idx_try++)
			{
				if (idx_try)
				{
					syslog(LOG_INFO, "trying again closing and reopening the serial port, try %u of %u", idx_try +1, def_max_try_connect_CC2650);
				}
				else
				{
					syslog(LOG_INFO, "Sleeping before opening the serial port %s", def_selected_serial_port);
				}
				usleep(100*1000);
				//
				// Connect to device
				//
				syslog(LOG_INFO, "Opening the serial port %s", def_selected_serial_port);
				if(pDevice->connect(def_selected_serial_port, false) != SBL_SUCCESS)
				{
					pDevice->CloseSerialPort();
				}
				else
				{
					connected_OK = 1;
				}
			}
			if (connected_OK)
			{
				syslog(LOG_INFO, "device connected OK");
			}
			else
			{
				r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_connect_with_the_chip;
				syslog(LOG_ERR, "Opening the serial port %s something went wrong", def_selected_serial_port);
			}
		}
	}

	// read file with all of the checks needed
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Read file
		//
		syslog(LOG_INFO, "Opening the file %s", fileName);
		file = fopen(fileName, "rb");
		if( !file)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_open_the_firmware_file;
			syslog(LOG_ERR, "unable to open the file %s", fileName);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Get file size:
		//
		if (fseek(file, 0L, SEEK_END) != 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_seek_to_the_file_end;
			syslog(LOG_ERR, "unable to seek to the very end of the file");
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		long int ft = ftell(file);
		byteCount = (uint32_t)ft;
		if (ft < 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_get_filesize;
			syslog(LOG_ERR, "unable to get the file size");
		}
		else
		{
			syslog(LOG_INFO, "Number of bytes in the file: %u", byteCount);
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (fseek(file, 0L, SEEK_SET) != 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_seek_where_the_file_begins;
			syslog(LOG_ERR, "unable to seek to the begin of the file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		//
		// Read data
		//
		pvWrite = (char*)realloc(pvWrite, byteCount);
		if (!pvWrite)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_allocate_the_read_buffer;
			syslog(LOG_ERR, "unable to allocate the read buffer");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (fread((char*)&pvWrite[0], byteCount, 1, file) != 1)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_read_the_whole_file;
			syslog(LOG_ERR, "unable to read the whole file");
		}
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (fclose(file) != 0)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_unable_to_close_the_file;
			syslog(LOG_ERR, "unable to close the file");
		}
		file = NULL;
	}
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (byteCount <= sizeof(type_ASACZ_CC2650_fw_update_header))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_filesize_too_small;
			syslog(LOG_ERR, "the file size is too small to contain both header and body");
		}
	}

	type_ASACZ_CC2650_fw_update_header * p_header = (type_ASACZ_CC2650_fw_update_header *)&pvWrite[0];
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		uint32_t calc_crc_header = calcCrcLikeChip((unsigned char *)p_header, sizeof(type_ASACZ_CC2650_fw_update_header) - sizeof(p_header->header_CRC32_CC2650));
		if (calc_crc_header != p_header->header_CRC32_CC2650)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_header_CRC32;
			syslog(LOG_ERR, "header has invalid header CRC : calculated is 0x%08X, header has 0x%08X", calc_crc_header, p_header->header_CRC32_CC2650);
		}
		else
		{
			syslog(LOG_INFO, "magic key  %s"	, p_header->magic_name);
			syslog(LOG_INFO, "ASCII ver. %s"	, p_header->ascii_version_number);
			syslog(LOG_INFO, "date       %s"	, p_header->date);
			syslog(LOG_INFO, "fw version %u.%u.%u"	, p_header->fw_version_major, p_header->fw_version_middle, p_header->fw_version_minor);
			syslog(LOG_INFO, "body size  %u"		, p_header->firmware_body_size);
			syslog(LOG_INFO, "BODY CRC   0x%08X"	, p_header->firmware_body_CRC32_CC2650);
			syslog(LOG_INFO, "header CRC 0x%08X"	, p_header->header_CRC32_CC2650);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (strcmp((const char*)p_header->magic_name, (const char*)def_magic_name_ASACZ_CC2650_fw_update_header))
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_header_magic_key;
			syslog(LOG_ERR, "header has invalid magic name %s", (const char*)p_header->magic_name);
		}
	}

	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		if (p_header->firmware_body_size + sizeof(type_ASACZ_CC2650_fw_update_header) != byteCount)
		{
			r = enum_do_CC2650_fw_update_retcode_ERR_invalid_body_size;
			syslog(LOG_ERR, "header has invalid body size; expected %u, read %u", p_header->firmware_body_size, (unsigned int)(byteCount - sizeof(type_ASACZ_CC2650_fw_update_header)));
		}
	}

	unsigned char * p_firmware_body = (unsigned char *)&pvWrite[0];
	uint32_t body_size = 0;
	if (r == enum_do_CC2650_fw_update_retcode_OK)
	{
		body_size = p_header->firmware_body_size;
		p_firmware_body = (unsigned char *)&pvWrite[0] + sizeof(type_ASACZ_CC2650_fw_update_header);
		//
		// Calculate file CRC checksum
		//
		syslog(LOG_ERR, "about to calculate the CRC");
		fileCrc = calcCrcLikeChip(p_firmware_body, body_size);
		syslog(LOG_ERR, "the CRC is 0x%X", fileCrc);
	}

